#+TITLE: Writing technical documents in org-mode
#+AUTHOR: John Kitchin
#+LATEX_CLASS: cmu-article
#+OPTIONS: ^:{} # make super/subscripts only when wrapped in {}
#+OPTIONS: toc:nil # suppress toc, so we can put it where we want
#+OPTIONS: tex:t
#+EXPORT_EXCLUDE_TAGS: noexport

\maketitle
\tableofcontents

* Source code
One of the main reasons to use org-mode is the integration of source code. 

#+BEGIN_SRC python
import matplotlib.pyplot as plt
plt.plot([1,4,7,9])
plt.savefig('fig1.png')
#+END_SRC

#+RESULTS:

By default all blocks will be rendered and included in the exported document. You control this in the source block header. Here is a block that is not exported, nor are the results.

#+BEGIN_SRC python :exports none
print 'hello world'
#+END_SRC

#+RESULTS:
: hello world

